//NETEC_Node.h
#ifndef __NETEC_NODE_H__
#define __NETEC_NODE_H__
// NETEC_Session;
#include "NETEC_Session.h"
#include "NETEC.h"

//Õ¯¬ÁΩ⁄µ„
class NETEC_API NETEC_Node
{
public:
	NETEC_Node(void);
	virtual~NETEC_Node(void);
public:
	/******************************************************************************
	* SetServerIP
	*√Ë ˆ£∫…Ë÷√∑˛ŒÒ∆˜IP
	* ‰»Î£∫	cszServerIP			-∑˛ŒÒ∆˜IP
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	static void SetServerIP(const char*cszServerIP);
	static const char*GetServerIP(void);

	/******************************************************************************
	* SetServerPort
	*√Ë ˆ£∫…Ë÷√∑˛ŒÒ∆˜∂Àø⁄
	* ‰»Î£∫	usServerPort		-∑˛ŒÒ∆˜∂Àø⁄
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	static void SetServerPort(unsigned short usServerPort);
	static unsigned short GetServerPort(void);

	/******************************************************************************
	* Start
	*√Ë ˆ£∫∆Ù∂Ø±æΩ⁄µ„
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫≥…π¶∑µªÿ0£¨ ß∞‹∑µªÿ-1
	*****************************************************************************/
	static int Start(void);

	/******************************************************************************
	* IsStarted
	*√Ë ˆ£∫±æΩ⁄µ„ «∑Ò“—æ≠∆Ù∂Ø
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫»Áπ˚±æΩ⁄µ„“—æ≠∆Ù∂Ø£¨ƒ«√¥∑µªÿ∑«0£¨∑Ò‘Ú∑µªÿ0
	*****************************************************************************/
	static int IsStarted(void);

	/******************************************************************************
	* Stop
	*√Ë ˆ£∫Õ£÷π±æΩ⁄µ„
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	static void Stop(void);

	/******************************************************************************
	* GetNodeID
	*√Ë ˆ£∫ªÒ»°±æΩ⁄µ„µƒ±Í ∂
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫±æΩ⁄µ„µƒ±Í ∂
	*****************************************************************************/
	static const char*GetNodeID(void);

	/******************************************************************************
	* GetLocalIP
	*√Ë ˆ£∫ªÒ»°±æª˙IP
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫±æµÿIP
	*****************************************************************************/
	static const char*GetLocalIP(void);

	/******************************************************************************
	* GetLocalPort
	*√Ë ˆ£∫ªÒ»°±æª˙µƒ±æµÿ∂Àø⁄
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫±æª˙µƒ±æµÿ∂Àø⁄
	*****************************************************************************/
	static unsigned short GetLocalPort(void);

	/******************************************************************************
	* GetNATIP
	*√Ë ˆ£∫ªÒ»°±æª˙µƒÕ‚Õ¯µƒIP
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫±æª˙µƒÕ‚Õ¯µƒIP
	*****************************************************************************/
	static const char*GetNATIP(void);

	/******************************************************************************
	* GetNATPort
	*√Ë ˆ£∫ªÒ»°±æª˙µƒÕ‚Õ¯µƒ∂Àø⁄
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫±æª˙µƒÕ‚Õ¯µƒ∂Àø⁄
	*****************************************************************************/
	static unsigned short GetNATPort(void);

	/******************************************************************************
	* GetDomain
	*√Ë ˆ£∫ªÒ»°À˘‘⁄µƒ”Ú
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫À˘‘⁄µƒ”Ú
	*****************************************************************************/
	static const char*GetDomain(void);

	/******************************************************************************
	* GetDomainType
	*√Ë ˆ£∫ªÒ»°À˘‘⁄µƒ”Úµƒ¿‡–Õ
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫À˘‘⁄µƒ”Úµƒ¿‡–Õ
	*****************************************************************************/
	static NETEC::DOMAIN_TYPE GetDomainType(void);

	/******************************************************************************
	* GetMCUID
	*√Ë ˆ£∫ªÒ»°¡¨Ω”µƒMCU±Í ∂
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫¡¨Ω”µƒMCU±Í ∂
	*****************************************************************************/
	static const char*GetMCUID(void);

	/******************************************************************************
	* GetMCUIP
	*√Ë ˆ£∫ªÒ»°¡¨Ω”µƒMCUµƒIPµÿ÷∑
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫¡¨Ω”µƒMCUµƒIPµÿ÷∑
	*****************************************************************************/
	static const char*GetMCUIP(void);

	/******************************************************************************
	* GetMCUType
	*√Ë ˆ£∫ªÒ»°¡¨Ω”µƒMCUµƒ¿‡–Õ
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫¡¨Ω”µƒMCUµƒ¿‡–Õ
	*****************************************************************************/
	static unsigned int GetMCUType(void);

	/******************************************************************************
	* SendDataToNode
	*√Ë ˆ£∫∑¢ÀÕ ˝æ›∏¯Ω⁄µ„
	* ‰»Î£∫	cszNodeID			-Ω⁄µ„±Í ∂
			pData				-“™ÀÕµƒ ˝æ›
			nLen				-“™ÀÕµƒ ˝æ›µƒ≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫≥…π¶∑µªÿ0£ª ß∞‹∑µªÿ-1£¨±Ì æÕ¯¬ÁŒ¥¡¨Õ®
	*****************************************************************************/
	static int SendDataToNode(unsigned int nFromAgentID,unsigned int nToAgentID,const char*cszNodeID,const char*pData,int nLen);

	/******************************************************************************
	* SendDataToAgent
	*√Ë ˆ£∫∑¢ÀÕ ˝æ›∏¯Õ¯¬Á”¶”√
	* ‰»Î£∫	cszDomain			-Õ¯¬Á”¶”√À˘‘⁄µƒ”Ú
			nAgentID			-Õ¯¬Á”¶”√±Í ∂
			pData				-“™ÀÕµƒ ˝æ›
			nLen				-“™ÀÕµƒ ˝æ›µƒ≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫≥…π¶∑µªÿ0£ª ß∞‹∑µªÿ-1£¨±Ì æÕ¯¬ÁŒ¥¡¨Õ®
	*****************************************************************************/
	static int SendDataToAgent(const char*cszDomain,unsigned int nAgentID,const char*pData,int nLen);

	/******************************************************************************
	* SendDataToRouter
	*√Ë ˆ£∫∑¢ÀÕ ˝æ›∏¯Õ¯¬Á¬∑”…
	* ‰»Î£∫	cszDomain			-Õ¯¬Á¬∑”…À˘‘⁄µƒ”Ú
			pData				-“™ÀÕµƒ ˝æ›
			nLen				-“™ÀÕµƒ ˝æ›µƒ≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫≥…π¶∑µªÿ0£ª ß∞‹∑µªÿ-1£¨±Ì æÕ¯¬ÁŒ¥¡¨Õ®
	*****************************************************************************/
	static int SendDataToRouter(const char*cszDomain,const char*pData,int nLen);

	/******************************************************************************
	* GetConnectStatus
	*√Ë ˆ£∫ªÒ»°¡¨Ω”◊¥Ã¨
	* ‰»Î£∫	Œﬁ
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫¡¨Ω”◊¥Ã¨
	*****************************************************************************/
	static NETEC_Session::CONNECT_STATUS GetConnectStatus(void);

	/******************************************************************************
	* OnNETEC_NodeConnectStatusChanged
	*√Ë ˆ£∫Õ¯¬Á¡¨Ω”◊¥Ã¨µƒªÿµ˜
	* ‰»Î£∫	cs					-Õ¯¬Á¡¨Ω”◊¥Ã¨
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	virtual void OnNETEC_NodeConnectStatusChanged(NETEC_Session::CONNECT_STATUS cs){};

	/******************************************************************************
	* OnNETEC_NodeReceivedFromAgent
	*√Ë ˆ£∫ ’µΩÕ¯¬Á”¶”√ ˝æ›∞¸µƒªÿµ˜
	* ‰»Î£∫	cszDomain				-Õ¯¬Á”¶”√À˘‘⁄µƒ”Ú
			nAgentID				-Õ¯¬Á”¶”√±Í ∂
			pData					- ˝æ›
			nLen					- ˝æ›≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	virtual void OnNETEC_NodeReceivedFromAgent(const char*cszDomain,unsigned int nAgentID,const char* pData,int nLen){};

	/******************************************************************************
	* OnNETEC_NodeReceivedFromRouter
	*√Ë ˆ£∫ ’µΩÕ¯¬Á¬∑”… ˝æ›∞¸µƒªÿµ˜
	* ‰»Î£∫	cszDomain				-Õ¯¬Á¬∑”…À˘‘⁄µƒ”Ú
			pData					- ˝æ›
			nLen					- ˝æ›≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	virtual void OnNETEC_NodeReceivedFromRouter(const char*cszDomain,const char* pData,int nLen){};

	/******************************************************************************
	* OnNETEC_NodeReceivedFromNode
	*√Ë ˆ£∫ ’µΩÕ¯¬ÁΩ⁄µ„ ˝æ›∞¸µƒªÿµ˜
	* ‰»Î£∫	cszNodeID				-Õ¯¬ÁΩ⁄µ„±Í ∂
			pData					- ˝æ›
			nLen					- ˝æ›≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	virtual void OnNETEC_NodeReceivedFromNode(const char*cszNodeID,unsigned int nFromAgentID,unsigned int nToAgentID,const char* pData,int nLen){};

	/******************************************************************************
	* OnNETEC_NodeNodeDisconnected
	*√Ë ˆ£∫Õ¯¬ÁΩ⁄µ„≤ª‘⁄œﬂµƒªÿµ˜
	* ‰»Î£∫	cszNodeID				-Õ¯¬ÁΩ⁄µ„±Í ∂
			pData					- ˝æ›
			nLen					- ˝æ›≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	virtual void OnNETEC_NodeNodeDisconnected(const char*cszNodeID,unsigned int nFromAgentID,unsigned int nToAgentID,const char* pData,int nLen){};

	/******************************************************************************
	* OnNETEC_NodeAgentDisconnected
	*√Ë ˆ£∫Õ¯¬Á”¶”√≤ª‘⁄œﬂµƒªÿµ˜
	* ‰»Î£∫	cszDomain				-Õ¯¬Á”¶”√À˘‘⁄µƒ”Ú
			nAgentID				-Õ¯¬Á”¶”√±Í ∂
			pData					- ˝æ›
			nLen					- ˝æ›≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	virtual void OnNETEC_NodeAgentDisconnected(const char*cszDomain,unsigned int nAgentID,const char* pData,int nLen){};

	/******************************************************************************
	* OnNETEC_NodeRouterDisconnected
	*√Ë ˆ£∫Õ¯¬Á¬∑”…≤ª‘⁄œﬂµƒªÿµ˜
	* ‰»Î£∫	cszDomain				-Õ¯¬Á¬∑”…À˘‘⁄µƒ”Ú
			pData					- ˝æ›
			nLen					- ˝æ›≥§∂»
	* ‰≥ˆ£∫ Œﬁ
	*∑µªÿ÷µ£∫Œﬁ
	*****************************************************************************/
	virtual void OnNETEC_NodeRouterDisconnected(const char*cszDomain,const char* pData,int nLen){};

	/******************************************************************************
	* OnNETEC_NodeGetUserInfo
	*√Ë ˆ£∫ªÒ»°”√ªß–≈œ¢µƒªÿµ˜
	* ‰»Î£∫	cszUserID				-”√ªß±Í ∂
	* ‰≥ˆ£∫ szNodeID				-”√ªßµƒÕ¯¬ÁΩ⁄µ„±Í ∂
	*∑µªÿ÷µ£∫≥…π¶∑µªÿ0£ª ß∞‹∑µªÿ-1£¨±Ì æ∏√”√ªß≤ª‘⁄œﬂ
	*****************************************************************************/
	virtual int OnNETEC_NodeGetUserInfo(const char*cszUserID,char*szNodeID){return -1;};
	
	static void SetLocalUserID(const char*cszLocalUserID);
	static void SetLocalUserName(const char*cszLocalUserName);
};


#endif